[基本设置]
开机自启=0
管理员启动=1
自动切换=1
默认输入法=1
切换提示=4
切换提示时间=1500
切换提示文字大小=15,30
切换提示透明度=235,180
切换提示偏移=0,0
切换提示固定位置=50,30
托盘图标显示=1
托盘图标双击=2
托盘图标显示输入法=1
托盘图标样式=
鼠标指针显示输入法=1
鼠标指针样式=
鼠标指针对应分辨率=0
[热键屏蔽窗口列表]
[切换屏蔽窗口列表]
[切换提示屏蔽窗口列表]
窗口切换=ahk_class MultitaskingViewFrame
[二次切换屏蔽窗口列表]
TC新建文件夹=ahk_class TCOMBOINPUT
TC搜索=ahk_class TFindFile
TC快搜=ahk_class TQUICKSEARCH
[焦点控件切换窗口列表]
Xshell=ahk_exe Xshell.exe
Steam=ahk_exe Steam.exe
有道词典=ahk_exe YoudaoDict.exe
[热键设置]
添加至中文窗口=
添加至英文(中文)窗口=
添加至英文输入法窗口=
移除从中英文窗口=
切换中文=
切换英文(中文)=
切换英文输入法=^y
切换中英文(中文)=
切换中英文输入法=
显示当前输入法=
重置当前输入法=
停止自动切换=
获取输入法IME代码=
[特殊热键]
左Shift=1
右Shift=2
左Ctrl=0
右Ctrl=0
左Alt=0
右Alt=0
[高级设置]
内部关联=..\RunAny\RunAnyConfig.ini
快捷键兼容=1
左键点击输入位置显示输入法状态=1|全局窗口
左键弹起后提示输入法状态生效窗口=Code.exe
定时重置输入法=60|编辑器
切换重置大小写=1
上屏字符内容=2|1
提示颜色=333434|dfe3e3|02ecfb|ff0000
托盘提示内容=KBLAutoSwitch（%权限%）`n%启动时间%`n版本：%版本%`n最新版本：%最新版本%`n自动切换统计：%自动切换次数%
自动检查更新=30
[自定义窗口组]
1=全局窗口=0=AllGlobalWin=全局窗口组
2=编辑器=2=sublime_text.exe|Code.exe=编辑器窗口组
3=不重置大小写组=1=RunAny_SearchBar ahk_exe RunAny.exe=切换窗口不重置大小写
4=TC=2=ahk_exe TOTALCMD.exe|TotalCMD64.exe=TC
[自定义操作]
1=2=s-; |# =1=ahk、py注释切换中文
2=2=k-~Enter|~Esc=6=回车、Esc切换英文
3=4=k-~F2|~F7|~^s=1=TC切换中文
4=4=k-~Enter|~Esc=6=TC回车或ESC重置输入法
[中文窗口]
win搜索栏=ahk_exe SearchApp.exe
OneNote for Windows 10=uwp  OneNote for Windows 10
[英文窗口]
win桌面=ahk_class WorkerW ahk_exe explorer.exe
win桌面=ahk_class Progman ahk_exe explorer.exe
文件资源管理器=ahk_class CabinetWClass ahk_exe explorer.exe
cmd=ahk_exe cmd.exe
任务管理器=ahk_exe taskmgr.exe
[英文输入法窗口]
死亡细胞=ahk_exe deadcells.exe
闹钟和时钟=uwp 闹钟和时钟
[信息变量]
最近检查更新日期=2025-10-25 20:38:33
